# 問１の辞書型データを以下に定義してください。


# 問２
# 2-1. 未達成の科目（value が Falseのもの）だけを表示する関数の定義。
def print_unfinished():
    # 以下に書かれている print("----------------") や print("未達成の科目:") は 消さないこと
    print("----------------")
    print("未達成の科目:")
    # 以下に関数内で行う処理を書いてください。
    # ヒント：辞書をループする方法について調べましょう！


# 2-2. print_unfinished関数を実行するコードを以下に記述してください。


# 問３
# 3-1. 未達成の科目を達成済みに変更する関数の定義。
# 「未達成 → 達成済み」 に更新するだけなので、関数内で print() や return などは使用しないでください。
def complete_subject(subject):
    # 以下に関数内で行う処理を書いてください


## 3-2. complete_subject関数を実行するコードを以下に記述してください。


## 3-3. 再度print_unfinished関数を実行するコードを以下に記述してください。


